app/Controllers/RocketController.php

    public function index()
    {
        $model = new RocketModel();
        $data['rockets'] = $model->findAll();
---
SELECT *
FROM `rockets`

    public function edit($id)
    {
        $model = new RocketModel();
        $rocket = $model->find($id);
---
SELECT *
FROM `rockets`
WHERE `rockets`.`id` = '3'